#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.ssh_key2: Refreshing state... [id=b8fb8621e201ff818ee1610488adc17c70d4f9bd]
tls_private_key.ssh_key1: Refreshing state... [id=3e4a961a273a6981b9cc0bf1ea3b43737c12b295]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05MzE4MjkwMS1jZGU2LTRmMGQtOGQ1Mi00YTg2ZjZlNzg5MzA7b2JqZWN0SWQ9ZGYzNTY1ZGMtNDEzZC00NmY1LTg2OTUtOTAyNjFlYjA0ZmUyO3N1YnNjcmlwdGlvbklkPTNmZTM0YzdkLTg0ODYtNGZmZi1hZDEwLWEzYWZjMGNmMDliNTt0ZW5hbnRJZD1mN2YxNmFjMS1jZWNiLTQzODMtYjAxMS04Y2ViZmI5OWUwYmE=]
azurerm_application_security_group.asg2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/applicationSecurityGroups/tf-demo-asg-databases]
azurerm_virtual_network.vnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-demo-vnet]
random_id.random_id2: Refreshing state... [id=v9oXMbPFMV0]
random_id.random_id: Refreshing state... [id=USxiMomAWiY]
azurerm_public_ip.nic1_ip: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/publicIPAddresses/lt-tf-demo-public-ip]
azurerm_application_security_group.asg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/applicationSecurityGroups/tf-demo-asg-servers]
azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv]
azurerm_storage_account.storage_boot_diagnostics: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Storage/storageAccounts/diag512c623289805a26]
azurerm_storage_account.storage_boot_diagnostics2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Storage/storageAccounts/diagbfda1731b3c5315d]
azurerm_network_security_group.nsg1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg]
azurerm_subnet.subnet2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-demo-vnet/subnets/lt-tf-demo-subnet2]
azurerm_subnet.subnet1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/virtualNetworks/lt-tf-demo-vnet/subnets/lt-tf-demo-subnet]
azurerm_network_interface.nic1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1]
azurerm_network_interface.nic2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic2]
azurerm_key_vault_access_policy.kv_policy: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv/objectId/df3565dc-413d-46f5-8695-90261eb04fe2]
azurerm_network_interface_security_group_association.nic1_nsg1_connect: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg]
azurerm_network_interface_application_security_group_association.asgnic1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic1|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/applicationSecurityGroups/tf-demo-asg-servers]
data.azurerm_key_vault.kv1: Reading...
azurerm_network_interface_security_group_association.nic2_nsg1_connect: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic2|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkSecurityGroups/lt-tf-demo-nsg]
azurerm_network_interface_application_security_group_association.asgnic2: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic2|/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/applicationSecurityGroups/tf-demo-asg-databases]
data.azurerm_key_vault.kv1: Read complete after 1s [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.KeyVault/vaults/lt-tf-demo-kv]
azurerm_key_vault_secret.privatekey2: Refreshing state... [id=https://lt-tf-demo-kv.vault.azure.net/secrets/lt-tf-demo-vm2-privatekey/e00dd7ae61d747f0b35ebc26ac0ebbac]
azurerm_key_vault_secret.privatekey: Refreshing state... [id=https://lt-tf-demo-kv.vault.azure.net/secrets/lt-tf-demo-vm1-privatekey/c7b65f685a194ed5a21436621aff9b95]
azurerm_linux_virtual_machine.vm1: Refreshing state... [id=/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-demo-vm1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm1 will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "vm1" {
        id                                                     = "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Compute/virtualMachines/lt-tf-demo-vm1"
        name                                                   = "lt-tf-demo-vm1"
      ~ size                                                   = "Standard_B1s" -> "Standard_B1S"
        tags                                                   = {}
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.vm2 will be created
  + resource "azurerm_linux_virtual_machine" "vm2" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "lt-tf-demo-vm2"
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "norwayeast"
      + max_bid_price                                          = -1
      + name                                                   = "lt-tf-demo-vm2"
      + network_interface_ids                                  = [
          + "/subscriptions/3fe34c7d-8486-4fff-ad10-a3afc0cf09b5/resourceGroups/lt-tf-demo-rg/providers/Microsoft.Network/networkInterfaces/lt-tf-demo-nic2",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "lt-tf-demo-rg"
      + size                                                   = "Standard_B1S"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC7zU2dtpXTOoBFPLw66ATNk2foOqEgZ7gmxiBSrxq31CoAyih85KnFlq4MrfTlRPIfBKC4RRLBLYKEsza5chBvtzc1huqaWEjkdWhqJuSdGxnVNepcP+t5z87orQKGpNSqDo7HrkUeOZIOqw8OL2Vzy3QZrZv7JBbP6UNkEJDnhfNBIxRcHJ/5Fr6AO1ivaxcrkbann/ncA6DcI+iB0RXwG+x8InZQiNHBWNwVlg1H80xA+CE1iSaKI6Ck7C/VsXOv9+eTKStYgW19ffrYk2vsgyLRYr7Hu1s68IIzob0Gmi50K8COIMdZjpUEvOjQCu6K62oua9inBEMUUUmC0oeJ90za/oDeMo/Exaw/zIroXTWWWn1hdDcJCCtZcj12ID1uNdiE49v0OnFaDx3Qy/89KxAsijsFIYgoFGVxzcDm/w4i8oulYRBx/5MJk32GupZHx1SWxEsr421x9UgzcstlQ+UU1ilogGlM8w2ne0FJmox7F6UrAeUfpaWDrzXNXAym46uZHN1f2JWhiyQIofo6q+e8Nj/5f/mfNThaEOXlDQK9oX2Vt8zBoZ/Z8BflyDWRTsyngpiD/CkuPqu2QlCAcudcY2dRL4zhe0TwjbCKnKuvAdAQNbt0T0WsANuuiIQ46VV6qEkpQCI3AIHBcicYyHU9l/QlJh5c27hkAPBSoQ==
            EOT
          + username   = "azureuser"
        }

      + boot_diagnostics {
          + storage_account_uri = "https://diagbfda1731b3c5315d.blob.core.windows.net/"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "lt-tf-demo-vm2-disk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts"
          + version   = "latest"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @larstthorsen, Action: `pull_request`*